import React from 'react';
//import logo from './logo.svg';
import './App.css';
import Header from './Header.js';
import Footer from './Footer.js';
import Caroisel from './Carousel.js';


function App() {
  return (
    <div>
      <Header/>
      <div className="content">
        <div className="carousel">
          <Caroisel/>
        </div>
Там, где, сливаяся, шумят,
Обнявшись, будто две сестры,
Струи Арагвы и Куры,
Был монастырь. Из-за горы
И нынче видит пешеход
Столбы обрушенных ворот,
И башни, и церковный свод;
Но не курится уж под ним
Кадильниц благовонный дым,
Не слышно пенье в поздний час
Молящих иноков за нас.
Теперь один старик седой,
Развалин страж полуживой,
Людьми и смертию забыт,
Сметает пыль с могильных плит,
Которых надпись говорит
О славе прошлой — и о том,
Как, удручен своим венцом,
Такой-то царь, в такой-то год,
Вручал России свой народ.
И божья благодать сошла
На Грузию! Она цвела
С тех пор в тени своих садов,
Не опасаяся врагов,
За гранью дружеских штыков.
2
Однажды русский генерал
Из гор к Тифлису проезжал;
Ребенка пленного он вез.
Тот занемог, не перенес
Трудов далекого пути;
Он был, казалось, лет шести,
Как серна гор, пуглив и дик
И слаб и гибок, как тростник.
Но в нем мучительный недуг
Развил тогда могучий дух
Его отцов. Без жалоб он
Томился, даже слабый стон
Из детских губ не вылетал,
Он знаком пищу отвергал
И тихо, гордо умирал.
Из жалости один монах
Больного призрел, и в стенах
Хранительных остался он,
Искусством дружеским спасен.
Но, чужд ребяческих утех,
Сначала бегал он от всех,
Бродил безмолвен, одинок,
Смотрел, вздыхая, на восток,
Томим неясною тоской
По стороне своей родной.
Но после к плену он привык,
Стал понимать чужой язык,
Был окрещен святым отцом
И, с шумным светом незнаком,
Уже хотел во цвете лет
Изречь монашеский обет,
Как вдруг однажды он исчез
Осенней ночью. Темный лес
Тянулся по горам кругом.
Три дня все поиски по нем
Напрасны были, но потом
Его в степи без чувств нашли
И вновь в обитель принесли.
Он страшно бледен был и худ
И слаб, как будто долгий труд,
Болезнь иль голод испытал.
Он на допрос не отвечал
И с каждым днем приметно вял.
И близок стал его конец;
Тогда пришел к нему чернец
С увещеваньем и мольбой;
И, гордо выслушав, больной
Привстал, собрав остаток сил,
И долго так он говорил:
3
«Ты слушать исповедь мою
Сюда пришел, благодарю.
Все лучше перед кем-нибудь
Словами облегчить мне грудь;
Но людям я не делал зла,
И потому мои дела
Немного пользы вам узнать,—
А душу можно ль рассказать?
Я мало жил, и жил в плену.
Таких две жизни за одну,
Но только полную тревог,
Я променял бы, если б мог.
Я знал одной лишь думы власть,
Одну — но пламенную страсть:
Она, как червь, во мне жила,
Изгрызла душу и сожгла.
Она мечты мои звала
От келий душных и молитв
В тот чудный мир тревог и битв,
Где в тучах прячутся скалы,
Где люди вольны, как орлы.
Я эту страсть во тьме ночной
Вскормил слезами и тоской;
Ее пред небом и землей
Я ныне громко признаю
И о прощенье не молю.
4
Старик! я слышал много раз,
Что ты меня от смерти спас —
Зачем?.. Угрюм и одинок,
Грозой оторванный листок,
Я вырос в сумрачных стенах
Душой дитя, судьбой монах.
Я никому не мог сказать
Священных слов „отец“ и „мать“.
Конечно, ты хотел, старик,
Чтоб я в обители отвык
От этих сладостных имен,—
Напрасно: звук их был рожден
Со мной. Я видел у других
Отчизну, дом, друзей, родных,
А у себя не находил
Не только милых душ — могил!
Тогда, пустых не тратя слез,
В душе я клятву произнес:
Хотя на миг когда-нибудь
Мою пылающую грудь
Прижать с тоской к груди другой,
Хоть незнакомой, но родной.
Увы! теперь мечтанья те
Погибли в полной красоте,
И я как жил, в земле чужой
Умру рабом и сиротой.
5
Меня могила не страшит:
Там, говорят, страданье спит
В холодной вечной тишине;
Но с жизнью жаль расстаться мне.
Я молод, молод... Знал ли ты
Разгульной юности мечты?
Или не знал, или забыл,
Как ненавидел и любил;
Как сердце билося живей
При виде солнца и полей
С высокой башни угловой,
Где воздух свеж и где порой
В глубокой скважине стены,
Дитя неведомой страны,
Прижавшись, голубь молодой
Сидит, испуганный грозой?
Пускай теперь прекрасный свет
Тебе постыл: ты слаб, ты сед,
И от желаний ты отвык.
Что за нужда? Ты жил, старик!
Тебе есть в мире что забыть,
Ты жил,— я также мог бы жить!
6
Ты хочешь знать, что видел я
На воле? — Пышные поля,
Холмы, покрытые венцом
Дерев, разросшихся кругом,
Шумящих свежею толпой,
Как братья в пляске круговой.
Я видел груды темных скал,
Когда поток их разделял,
И думы их я угадал:
Мне было свыше то дано!
Простерты в воздухе давно
Объятья каменные их,
И жаждут встречи каждый миг;
Но дни бегут, бегут года —
Им не сойтиться никогда!
Я видел горные хребты,
Причудливые, как мечты,
Когда в час утренней зари
Курилися, как алтари,
Их выси в небе голубом,
И облачко за облачком,
Покинув тайный свой ночлег,
К востоку направляло бег —
Как будто белый караван
Залетных птиц из дальних стран!
Вдали я видел сквозь туман,
В снегах, горящих, как алмаз,
Седой незыблемый Кавказ;
И было сердцу моему
Легко, не знаю почему.
Мне тайный голос говорил,
Что некогда и я там жил,
И стало в памяти моей
Прошедшее ясней, ясней...
7


      </div>
      <Footer/>
    </div>

  );
}

export default App;
